# Pandas

## Series

In [4]:
import numpy as np
import pandas as pd

In [7]:
labels = ['a','b','c']
my_data = [10,20,30]
arr = np.array(my_data)
d = {'a':10,'b':20,'c':30}

In [3]:
labels

['a', 'b', 'c']

In [4]:
my_data

[10, 20, 30]

In [5]:
d

{'a': 10, 'b': 20, 'c': 30}

In [6]:
pd.Series(data = my_data)

0    10
1    20
2    30
dtype: int64

In [7]:
pd.Series(data=my_data,index=labels)

a    10
b    20
c    30
dtype: int64

In [9]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int32

In [10]:
pd.Series(arr,labels)

a    10
b    20
c    30
dtype: int32

In [11]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [12]:
pd.Series(labels)

0    a
1    b
2    c
dtype: object

In [14]:
pd.Series([sum,print,len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [13]:
serl = pd.Series([1,2,3,4],['USA','Germany','USSR','Japan'])

In [14]:
serl

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [30]:
serl["USA"]

1

In [31]:
ser3 = pd.Series(labels)

In [32]:
ser3

0    a
1    b
2    c
dtype: object

In [33]:
ser3[0]

'a'

In [30]:
ser2 = pd.Series([1,2,5,4, 10],['USA','Germany','USSR','Japan', "Italy"])

In [20]:
ser2

USA        1
Germany    2
USSR       5
Japan      4
dtype: int64

In [21]:
serl+ser2

USA        2
Germany    4
USSR       8
Japan      8
dtype: int64

In [22]:
ser3 = pd.Series(labels)

In [23]:
ser3

0    a
1    b
2    c
dtype: object

In [24]:
ser3[0]

'a'

In [32]:
serl + ser2

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       8.0
dtype: float64

In [26]:
ser2

USA        1
Germany    2
USSR       5
Japan      4
dtype: int64

## Dataframes

In [33]:
from numpy.random import randn

In [34]:
np.random.seed(101)

In [35]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [36]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [37]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [38]:
type(df['W'])

pandas.core.series.Series

In [39]:
type(df)

pandas.core.frame.DataFrame

In [40]:
df.W # don't use this is column name can get updated

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [41]:
df[['W','Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [45]:
df['new'] = df['W'] + df['Y']

In [46]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [48]:
df.drop('new', axis = 1)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [49]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [50]:
df.drop('new',axis=1,inplace=True)

In [51]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [52]:
df.drop('E',axis=0,inplace=True)

In [53]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [54]:
df.shape

(4, 4)

In [55]:
df.shape[0]

4

In [56]:
df.shape[1]

4

In [57]:
df.loc['A']

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [58]:
df.loc[['A','B']]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965

In [59]:
df.iloc[0]

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [60]:
df.iloc[[0,1]]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965

In [61]:
df.loc['B','Y']

-0.8480769834036315

In [63]:
df.loc[['A','B'],['W','X']]

          W         X
A  2.706850  0.628133
B  0.651118 -0.319318

In [64]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [66]:
booldf = df > 0

In [68]:
df[booldf]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057

In [69]:
df[df>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057

In [70]:
df['W'] > 0

A     True
B     True
C    False
D     True
Name: W, dtype: bool

In [73]:
df[df['W']>0]['X']

A    0.628133
B   -0.319318
D   -0.758872
Name: X, dtype: float64

In [72]:
df[df['Z']<0]

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

In [74]:
df[df['W']>0][['Y','X']]

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872

In [75]:
boolser = df['W'] > 0

In [76]:
boolser

A     True
B     True
C    False
D     True
Name: W, dtype: bool

In [77]:
result = df[boolser]

In [78]:
result

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057

In [80]:
mycols = ['Y','X']
result[mycols]

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872

In [82]:
df[(df['W']> 0) and (df['Y']>0)] # and operator can only take a single boolean values

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [83]:
df[(df['W']> 0) & (df['Y']>0)] # & works for series of values

         W         X         Y         Z
A  2.70685  0.628133  0.907969  0.503826

In [84]:
df[(df['W']> 0) | (df['Y']>0)]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [87]:
df.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057

In [88]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [92]:
newIndex = 'CA NY WY OR'.split()

In [93]:
newIndex

['CA', 'NY', 'WY', 'OR']

In [94]:
df['States'] = newIndex

In [95]:
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR

In [96]:
df.set_index('States')

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057

In [97]:
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR

## Dataframes 3

In [101]:
#Index Levels
outside = ["G1","G1","G1","G2","G2","G2"]
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
print(hier_index, "after zip")
hier_index = pd.MultiIndex.from_tuples(hier_index)
print(hier_index, "after multiIndex")

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)] after zip
MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           ) after multiIndex

In [102]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [114]:
df = pd.DataFrame(randn(6,2),hier_index,['A','B'])

In [115]:
df

                    A         B
Groups  Num
G1      1   -0.497104 -0.754070
        2   -0.943406  0.484752
        3   -0.116773  1.901755
G2      1    0.238127  1.996652
        2   -0.993263  0.196800
        3   -1.136645  0.000366

In [116]:
df.loc['G1']

            A         B
Num
1   -0.497104 -0.754070
2   -0.943406  0.484752
3   -0.116773  1.901755

In [117]:
df.index.names = ['Groups ', 'Num']

In [118]:
df

                    A         B
Groups  Num
G1      1   -0.497104 -0.754070
        2   -0.943406  0.484752
        3   -0.116773  1.901755
G2      1    0.238127  1.996652
        2   -0.993263  0.196800
        3   -1.136645  0.000366

In [119]:
df.loc['G2'].loc[2]['B']

0.19679950499134005

In [120]:
df.loc['G1']

            A         B
Num
1   -0.497104 -0.754070
2   -0.943406  0.484752
3   -0.116773  1.901755

In [121]:
df.loc['G2']

            A         B
Num
1    0.238127  1.996652
2   -0.993263  0.196800
3   -1.136645  0.000366

In [122]:
df.loc['G1'].loc[1]

A   -0.497104
B   -0.754070
Name: 1, dtype: float64

In [123]:
df.index.names = ['Groups','Num']

In [124]:
df

                   A         B
Groups Num
G1     1   -0.497104 -0.754070
       2   -0.943406  0.484752
       3   -0.116773  1.901755
G2     1    0.238127  1.996652
       2   -0.993263  0.196800
       3   -1.136645  0.000366

In [127]:
df.loc['G2'].loc[2].loc['B']

0.19679950499134005

In [128]:
df.xs('G1')

            A         B
Num
1   -0.497104 -0.754070
2   -0.943406  0.484752
3   -0.116773  1.901755

In [131]:
df.xs(1,level="Num")

               A         B
Groups
G1     -0.497104 -0.754070
G2      0.238127  1.996652

## Missing Data

In [5]:
d = {'A': [1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}

In [6]:
d

{'A': [1, 2, nan], 'B': [5, nan, nan], 'C': [1, 2, 3]}

In [7]:
df = pd.DataFrame(d)

In [8]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [13]:
df.dropna(axis=0)

     A    B  C
0  1.0  5.0  1

In [14]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [16]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [17]:
df.fillna(value = 'FILL VALUE')

            A           B  C
0           1           5  1
1           2  FILL VALUE  2
2  FILL VALUE  FILL VALUE  3

In [18]:
df['A'].fillna(value =df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

## GroupBy

In [21]:
data = {'Company': ['GOOG','GOOG','MSFT','MSFT','FB','FB'], 
       'Person': ['Sam','Charlie','Amy','Vanessa','Carl', 'Sarah'],
       'Sales': [200,120,340,124,243,350]}
data

{'Company': ['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB'],
 'Person': ['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah'],
 'Sales': [200, 120, 340, 124, 243, 350]}

In [22]:
df = pd.DataFrame(data)

In [23]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [25]:
byCompy = df.groupby('Company')

In [27]:
byCompy.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [28]:
byCompy.sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [29]:
byCompy.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [30]:
byCompy.sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [32]:
df.groupby('Company').sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [34]:
df.groupby('Company').count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [35]:
df.groupby('Company').max()

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [36]:
df.groupby('Company').min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [39]:
df.groupby('Company').describe().transpose()['FB']

Sales  count      2.000000
       mean     296.500000
       std       75.660426
       min      243.000000
       25%      269.750000
       50%      296.500000
       75%      323.250000
       max      350.000000
Name: FB, dtype: float64

## Merging, Joining and Concatenating

In [40]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7])
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [42]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [43]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [44]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [49]:
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [50]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [51]:
pd.merge(left,right,how="inner",on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

## Operations

In [52]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})

In [53]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [54]:
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [57]:
df['col2'].nunique()

3

In [60]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [61]:
df[df['col1']>2]

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

In [65]:
df[(df['col1']>2) & (df['col2'] == 444)]

   col1  col2 col3
3     4   444  xyz

In [66]:
def times2(x):
    return x*2

In [68]:
times2(df['col1'])

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [69]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [70]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [71]:
df['col2'].apply( lambda x: x*2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [74]:
df.drop('col1',axis=1)

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [75]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [76]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [77]:
df.sort_values('col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [78]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [79]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [82]:
del df['col1']

In [83]:
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [84]:
df.columns

Index(['col2', 'col3'], dtype='object')

In [85]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [86]:
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [87]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [88]:
df.pivot_table(values='D', index=['A','B'],columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

## Data Input and Output

In [92]:
pip install sqlalchemy

Requirement already satisfied: sqlalchemy in c:\users\thoma\anaconda3\lib\site-packages (1.3.13)
Note: you may need to restart the kernel to use updated packages.

In [93]:
pip install lxml

Requirement already satisfied: lxml in c:\users\thoma\anaconda3\lib\site-packages (4.5.0)
Note: you may need to restart the kernel to use updated packages.

In [94]:
pip install html5lib

Requirement already satisfied: html5lib in c:\users\thoma\anaconda3\lib\site-packages (1.0.1)
Requirement already satisfied: six>=1.9 in c:\users\thoma\anaconda3\lib\site-packages (from html5lib) (1.14.0)
Requirement already satisfied: webencodings in c:\users\thoma\anaconda3\lib\site-packages (from html5lib) (0.5.1)
Note: you may need to restart the kernel to use updated packages.

In [95]:
pip install BeautifulSoup4

Requirement already satisfied: BeautifulSoup4 in c:\users\thoma\anaconda3\lib\site-packages (4.8.2)
Requirement already satisfied: soupsieve>=1.2 in c:\users\thoma\anaconda3\lib\site-packages (from BeautifulSoup4) (1.9.5)
Note: you may need to restart the kernel to use updated packages.

In [1]:
import pandas as pd

In [2]:
pwd

'C:\\Users\\thoma\\Documents\\Udemy-Python For Data Science and Machine Learning'

In [3]:
pd.read_csv("example.csv")

FileNotFoundError: [Errno 2] File example.csv does not exist: 'example.csv'